Revit 2024 API
BuiltInFailures.ParameterFailures Class
 Failures related to parameters and parameter operations.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Syntax
C#
public static class ParameterFailures
Visual Basic
Public NotInheritable Class ParameterFailures
Visual C++
public ref class ParameterFailures abstract sealed
Inheritance Hierarchy
System.Object
 Autodesk.Revit.DB.BuiltInFailures.ParameterFailures
See Also
BuiltInFailures.ParameterFailures Members
Autodesk.Revit.DB Namespace